org/2024-01-01-React_add_custom_eventlisteners.org
* React add custom eventlisteners
- add eventlistener using useEffect
#+begin_src javascript
    useEffect(() => {
      window.addEventListener("scroll", callbackFunction);  // add eventListener
      return () =>
      window.removeEventListener("scroll", callbackFunction);  // return eventListener remover function
  }, [])
#+end_src

- callback function for scrolling
#+begin_src javascript
    const listenToScroll = () => {
      let heightToHideFrom = 500;
      const winScroll = document.body.scrollTop ||
            document.documentElement.scrollTop;

      if (winScroll < heightToHideFrom) {
          // visibility &&      // to limit setting state only the first time
          setVisibility(false);
      } else {
          setVisibility(true);
      }
  }  
#+end_src

